Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Count Property
 Gets the number of elements actually contained in the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace